zlgopen/ametal/soc/hdsc/drivers/source/spi/am_hc32_spi_dma.c
    /* 解除片选信号 */
    __spi_cs_off(p_this, p_dev);

    return AM_OK;
}

am_local
int __spi_info_get (void *p_arg, am_spi_info_t *p_info)
{
    am_hc32_spi_dma_dev_t *p_this   = (am_hc32_spi_dma_dev_t *)p_arg;

    if (p_info == NULL) {
        return -AM_EINVAL;
    }

    /* 最大速率等于 PCLK */
    p_info->max_speed = __SPI_MAXSPEED_GET(p_hw_spi);
    p_info->min_speed = __SPI_MINSPEED_GET(p_hw_spi);
    p_info->features  = AM_SPI_CS_HIGH   |
                        AM_SPI_MODE_0    |
                        AM_SPI_MODE_1    |
                        AM_SPI_MODE_2    |
                        AM_SPI_MODE_3;   /* features */
    return AM_OK;
}

/**
 * \brief SPI 硬件初始化
 */
am_local
int __spi_hard_init (am_hc32_spi_dma_dev_t *p_this)
{
    amhw_hc32_spi_t *p_hw_spi = (amhw_hc32_spi_t *)(p_this->p_devinfo->spi_reg_base);

    if (p_this == NULL) {
        return -AM_EINVAL;
    }

    /* 配置为主机模式 */
    amhw_hc32_spi_mode_sel(p_hw_spi, AMHW_HC32_SPI_MODE_TYPE_MASTER);

    /* SPI使能 */
    amhw_hc32_spi_enable(p_hw_spi, AM_TRUE);

    /* 初始化配置SPI */
    return AM_OK;
}



am_local
void __dma_isr (void *p_arg, uint32_t stat)
{
    am_hc32_spi_dma_dev_t *p_this   = (am_hc32_spi_dma_dev_t *)p_arg;
    amhw_hc32_spi_t       *p_hw_spi = (amhw_hc32_spi_t *)(p_this->p_devinfo->spi_reg_base);


    /* 中断发生 */
    if (stat == AM_HC32_DMA_INT_COMPLETE)
    {
        /* 记录成功传送字节数 */
        if (p_this->p_cur_trans->p_txbuf != NULL) {
            p_this->p_cur_msg->actual_length += (p_this->p_cur_trans->nbytes)
                            *(p_this->p_cur_spi_dev->bits_per_word < 9 ? 1 : 2);
        }

        if ((p_this != NULL) &&
            (p_this->p_isr_msg != NULL) &&
            (p_this->p_isr_msg->pfn_complete != NULL)) {
            p_this->p_isr_msg->pfn_complete(p_this->p_isr_msg->p_arg);
        }

        /* 传输就绪 */
        __spi_mst_sm_event(p_this, __SPI_EVT_TRANS_LAUNCH);

        /* 禁能 */
        amhw_hc32_spi_dma_tx_disable(p_hw_spi);
        amhw_hc32_spi_dma_rx_disable(p_hw_spi);

        /* 片选关闭 */
        __spi_cs_off(p_this, p_this->p_cur_spi_dev);

        p_this->busy = AM_FALSE;

    } else {
        /* 中断源不匹配 */
    }
}

/**
 * \brief SPI 使用DMA传输
 */
am_local
int __spi_dma_trans (am_hc32_spi_dma_dev_t *p_dev)
{
    am_hc32_spi_dma_dev_t           *p_this      = (am_hc32_spi_dma_dev_t *)p_dev;
    const am_hc32_spi_dma_devinfo_t *p_devinfo   = p_this->p_devinfo;
    amhw_hc32_spi_t                 *p_hw_spi    = (amhw_hc32_spi_t *)(p_devinfo->spi_reg_base);
    am_spi_transfer_t                 *p_cur_trans = p_dev->p_cur_trans;

    static uint16_t tx_rx_trans = 0; 
    uint32_t   dma_flags[2]     = {0};  /* DMA发送通道描述符 */

    /* 连接DMA中断服务函数 */
    am_hc32_dma_isr_connect(p_this->p_devinfo->dma_chan_tx,
                           __dma_isr, 
                           (void *)p_this);

    /* DMA发送通道配置 */
    dma_flags[0] = AMHW_HC32_DMA_CHAN_TRANSFER_MODE_BLOCK    | /* SPI只有块传输模式 */
                   AMHW_HC32_DMA_CHAN_SIZE_8BIT              | /* 数据位宽 8bit */

                   AMHW_HC32_DMA_CHAN_RELOAD_SRC_ADD_DISABLE | /* 源地址不重载*/

                   AMHW_HC32_DMA_CHAN_DST_ADD_INC_DISABLE    | /* 目标地址不自增 */
                   AMHW_HC32_DMA_CHAN_RELOAD_DST_ADD_ENABLE  | /* 目标地址重载 */

                   AMHW_HC32_DMA_CHAN_RELOAD_COUNTER_ENABLE  | /* 传输数据量重载 */
                   AMHW_HC32_DMA_CHAN_INT_ERR_DISABLE        | /* 传输错误中断禁能 */
                   AMHW_HC32_DMA_CHAN_INT_TX_CMP_ENABLE      | /* 传输完成中断使能 */
                   AMHW_HC32_DMA_CHAN_CIRCULAR_MODE_DISABLE ;  /* 关闭循环模式 */

    /* DMA接收通道配置 */
    dma_flags[1] = AMHW_HC32_DMA_CHAN_TRANSFER_MODE_BLOCK    | /* SPI只有块传输模式 */
                   AMHW_HC32_DMA_CHAN_SIZE_8BIT              | /* 数据位宽 8bit */

                   AMHW_HC32_DMA_CHAN_SRC_ADD_INC_DISABLE    | /* 源地址不自增 */
                   AMHW_HC32_DMA_CHAN_RELOAD_SRC_ADD_ENABLE  | /* 源地址重载*/

                   AMHW_HC32_DMA_CHAN_RELOAD_DST_ADD_DISABLE | /* 目标地址不重载 */

                   AMHW_HC32_DMA_CHAN_RELOAD_COUNTER_ENABLE  | /* 传输数据量重载 */
                   AMHW_HC32_DMA_CHAN_INT_ERR_DISABLE        | /* 传输错误中断禁能 */
                   AMHW_HC32_DMA_CHAN_INT_TX_CMP_ENABLE      | /* 传输完成中断使能 */
                   AMHW_HC32_DMA_CHAN_CIRCULAR_MODE_DISABLE ;  /* 关闭循环模式 */

    /* 只发送不接收数据 */
    if (p_cur_trans->p_rxbuf == NULL) {

        /* 目标地址不自增 (接收数据buff地址不自增)*/;
        dma_flags[1] |= AMHW_HC32_DMA_CHAN_DST_ADD_INC_DISABLE;

        /* 建立接收通道描述符 */
        am_hc32_dma_xfer_desc_build(&(p_this->g_desc[1]),       /* 通道描述符 */
                                    (uint32_t)(&(p_hw_spi->data)),/* 源缓冲区首地址 */
                                    (uint32_t)(&tx_rx_trans),     /* 目的缓冲区首地址 */
                                     p_cur_trans->nbytes,         /* 传输字节数 */
                                     dma_flags[1]);               /* 传输配置 */

    /* 存在接收数据 */
    } else {

        /* 目标地址自增(接收数据buff地址自增) */
        dma_flags[1] |= AMHW_HC32_DMA_CHAN_DST_ADD_INC_ENABLE;

        /* 建立接收通道描述符 */ 
        am_hc32_dma_xfer_desc_build(&(p_this->g_desc[1]),          /* 通道描述符 */
                                    (uint32_t)(&(p_hw_spi->data)),   /* 源缓冲区首地址 */
                                    (uint32_t)(p_cur_trans->p_rxbuf),/* 目的缓冲区首地址 */
                                     p_cur_trans->nbytes,            /* 传输字节数 */
                                     dma_flags[1]);                  /* 传输配置 */
    }

    if (p_cur_trans->p_txbuf == NULL) {

        /* 源地址不自增(发送数据buff地址不自增) */
        dma_flags[0] |= AMHW_HC32_DMA_CHAN_SRC_ADD_INC_DISABLE;

        /* 建立发送通道描述符 */
        am_hc32_dma_xfer_desc_build(&(p_this->g_desc[0]),       /* 通道描述符 */
                                    (uint32_t)(&tx_rx_trans),          /* 源缓冲区首地址 */
                                    (uint32_t)(&(p_hw_spi->data)),/* 目的缓冲区首地址 */
                                    p_cur_trans->nbytes,          /* 传输字节数 */
                                    dma_flags[0]);                /* 传输配置 */
    } else {

        /* 源地址自增(发送数据buff地址自增) */
        dma_flags[0] |= AMHW_HC32_DMA_CHAN_SRC_ADD_INC_ENABLE;

        /* 建立发送通道描述符 */
        am_hc32_dma_xfer_desc_build(&(p_this->g_desc[0]),          /* 通道描述符 */
                                    (uint32_t)(p_cur_trans->p_txbuf),/* 源缓冲区首地址 */
                                    (uint32_t)(&(p_hw_spi->data)),   /* 目的缓冲区首地址 */
                                    p_cur_trans->nbytes,             /* 传输字节数 */
                                    dma_flags[0]);                   /* 传输配置 */
    }

