zlgopen/ametal/soc/hdsc/drivers/source/spi/am_hc32_spi_dma.c
    if (am_hc32_dma_xfer_desc_chan_cfg(&(p_this->g_desc[0]),
                                        AMHW_HC32_DMA_MER_TO_PER,  /* 内存到外设 */
                                        p_this->p_devinfo->dma_chan_tx) == AM_ERROR) {
        return AM_ERROR;
    }

    if (am_hc32_dma_xfer_desc_chan_cfg(&(p_this->g_desc[1]),
                                        AMHW_HC32_DMA_PER_TO_MER,  /* 外设到内存 */
                                        p_this->p_devinfo->dma_chan_rx) == AM_ERROR) {
        return AM_ERROR;
    }

    am_hc32_dma_priority_same();

    /* 设置每个DMA传输块大小为已开启的通道个数（1） */
    am_hc32_dma_block_data_size(p_this->p_devinfo->dma_chan_rx, 1);
    am_hc32_dma_block_data_size(p_this->p_devinfo->dma_chan_tx, 1);

    /* 设置DMA触发源*/
    if((p_devinfo->spi_reg_base) == HC32_SPI0_BASE) {
        am_hc32_dma_chan_src_set(p_this->p_devinfo->dma_chan_rx,
                                   HC32_DMA_SRC_TYPE_SPI0_RX);
        am_hc32_dma_chan_src_set(p_this->p_devinfo->dma_chan_tx,
                                   HC32_DMA_SRC_TYPE_SPI0_TX);

    } else if((p_devinfo->spi_reg_base) == HC32_SPI1_BASE) {

        am_hc32_dma_chan_src_set(p_this->p_devinfo->dma_chan_rx,
                                   HC32_DMA_SRC_TYPE_SPI1_RX);

        am_hc32_dma_chan_src_set(p_this->p_devinfo->dma_chan_tx,
                                   HC32_DMA_SRC_TYPE_SPI1_TX);
    }

    am_hc32_dma_chan_start(p_this->p_devinfo->dma_chan_rx);
    am_hc32_dma_chan_start(p_this->p_devinfo->dma_chan_tx);

    return AM_OK;
}

am_local
int __spi_config (am_hc32_spi_dma_dev_t *p_this)
{
    const am_hc32_spi_dma_devinfo_t *p_devinfo = p_this->p_devinfo;
    amhw_hc32_spi_t                 *p_hw_spi  = (amhw_hc32_spi_t *)(p_devinfo->spi_reg_base);
    am_spi_transfer_t                 *p_trans   = p_this->p_cur_trans;

    /* 如果为0，使用默认参数值 */
    if (p_trans->bits_per_word == 0) {
        p_trans->bits_per_word = p_this->p_cur_spi_dev->bits_per_word;
    }

    if (p_trans->speed_hz == 0) {
        p_trans->speed_hz = p_this->p_cur_spi_dev->max_speed_hz;
    }

    /* 设置字节数有效性检查 */
    if (p_trans->bits_per_word != 8) {
        return -AM_EINVAL;
    }

    /* 设置分频值有效性检查 */
    if (p_trans->speed_hz > __SPI_MAXSPEED_GET(p_hw_spi) ||
        p_trans->speed_hz < __SPI_MINSPEED_GET(p_hw_spi)) {
        return -AM_EINVAL;
    }

    /* 发送和接收缓冲区有效性检查 */
    if ((p_trans->p_txbuf == NULL) && (p_trans->p_rxbuf == NULL)) {
        return -AM_EINVAL;
    }

    /* 发送字节数检查 */
    if (p_trans->nbytes == 0) {
        return -AM_ELOW;
    }

    /* 配置SPI模式 */
    amhw_hc32_spi_clk_mode_set(p_hw_spi, p_this->p_cur_spi_dev->mode);

    /* 配置为主机模式 */
    amhw_hc32_spi_mode_sel(p_hw_spi, AMHW_HC32_SPI_MODE_TYPE_MASTER);

    /* 设置SPI速率 */
    __spi_speed_cfg(p_this, p_trans->speed_hz);

    return AM_OK;
}

/**
 * \brief SPI 传输数据函数
 */
am_local
int __spi_msg_start (void              *p_drv,
                     am_spi_device_t   *p_dev,
                     am_spi_message_t  *p_msg)
{
    am_hc32_spi_dma_dev_t *p_this = (am_hc32_spi_dma_dev_t *)p_drv;

    int key;

    /* 设备有效性检查 */
    if ((p_drv == NULL) || (p_dev == NULL) || (p_msg == NULL) ){
        return -AM_EINVAL;
    }

    p_msg->p_spi_dev       = p_dev; /* 设备参数信息存入到消息中 */
    p_this->p_cur_msg      = p_msg; /* 将当前设备传输消息存入 */
    p_this->nbytes_to_recv = 0;     /* 待接收字符数清0 */
    p_this->data_ptr       = 0;     /* 已接收字符数清0 */

    key = am_int_cpu_lock();

    /* 当前正在处理消息，只需要将新的消息加入链表即可 */
    if (p_this->busy == AM_TRUE) {
        __spi_msg_in(p_this, p_msg);
        am_int_cpu_unlock(key);
        return AM_OK;
    } else {
        p_this->busy = AM_TRUE;
        __spi_msg_in(p_this, p_msg);
        p_msg->status = -AM_EISCONN; /* 正在排队中 */
        am_int_cpu_unlock(key);

        /* 启动状态机 */
        return __spi_mst_sm_event(p_this, __SPI_EVT_TRANS_LAUNCH);
    }
}

/******************************************************************************/

/*  状态机内部状态切换 */
#define __SPI_NEXT_STATE(s, e) \
    do { \
        p_dev->state = (s); \
        new_event = (e); \
    } while(0)

/**
 * \brief SPI 使用状态机传输
 */
am_local
int __spi_mst_sm_event (am_hc32_spi_dma_dev_t *p_dev, uint32_t event)
{
    volatile uint32_t new_event = __SPI_EVT_NONE;
    amhw_hc32_spi_t *p_hw_spi = (amhw_hc32_spi_t *)(p_dev->p_devinfo->spi_reg_base);


    if (p_dev == NULL) {
        return -AM_EINVAL;
    }

    while (1) {

        if (new_event != __SPI_EVT_NONE) {  /* 检查新事件是否来自内部 */
            event     = new_event;
            new_event  = __SPI_EVT_NONE;
        }

        switch (p_dev->state) {

        case __SPI_ST_IDLE:         /* 控制器处于空闲状态 */
        {
            if (event != __SPI_EVT_TRANS_LAUNCH) {
                return -AM_EINVAL;  /* 空闲状态等待的消息必须是启动传输 */
            }

            /* 切换到消息开始状态，不用break */
        }
        /* no break */

        case __SPI_ST_MSG_START:    /* 消息开始 */
        {
            am_spi_message_t  *p_cur_msg   = NULL;

            int key;

            if (event != __SPI_EVT_TRANS_LAUNCH) {
                return -AM_EINVAL;  /* 消息开始状态等待的消息必须是启动传输 */
            }

            key = am_int_cpu_lock();
            p_cur_msg          = __spi_msg_out(p_dev);
            p_dev->p_cur_msg   = p_cur_msg;

            if (p_cur_msg) {
                p_cur_msg->status = -AM_EINPROGRESS;
            } else {

                p_dev->busy = AM_FALSE;
            }
            am_int_cpu_unlock(key);

            /* 无需要处理的消息 */
            if (p_cur_msg == NULL) {
                __SPI_NEXT_STATE(__SPI_ST_IDLE, __SPI_EVT_NONE);
                break;
            } else {

                p_dev->p_cur_spi_dev = p_cur_msg->p_spi_dev;

                /* 直接进入下一个状态，开始一个传输，此处无需break */
                __SPI_NEXT_STATE(__SPI_ST_TRANS_START, __SPI_EVT_TRANS_LAUNCH);

                event     = new_event;
                new_event = __SPI_EVT_NONE;
            }
        }
        /* no break */

        case __SPI_ST_TRANS_START:  /* 传输开始 */
        {
            am_spi_message_t *p_cur_msg = p_dev->p_cur_msg;

            p_dev->p_isr_msg = p_cur_msg;

            if (event != __SPI_EVT_TRANS_LAUNCH) {
                return -AM_EINVAL;  /* 传输开始状态等待的消息必须是启动传输 */
            }

